ka2_2024/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНеТребуетсяПриведениеСтрокВПараметры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНеТребуетсяПриведениеПараметровВФункцииИтог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Enums/ВариантыРасположенияГраницыФактическиДанных/ВариантыРасположенияГраницыФактическиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасположенияГраницыФактическиДанных</name>
  <enumValues>
    <name>ДоНачалаСоставленияБюджета</name>
  </enumValues>
  <enumValues>
    <name>ВнутриПериодаБюджета</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/НастройкаПериодаИсточникаДанных/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = БюджетнаяОтчетностьКлиентСервер.ПараметрыОткрытияФормыНастройкиПериода(Параметры);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыФормы);
	
	Если Не Параметры.Свойство("НефинансовыйПоказатель") Тогда
	
		УстановитьВидимостьНастройкиГруппировки(Параметры);
		
		СписокВыбора = Элементы.ГраницыДанных.СписокВыбора;
		Если Параметры.ВариантРасположенияГраницыФактическихДанных = Перечисления.ВариантыРасположенияГраницыФактическиДанных.ДоНачалаСоставленияБюджета Тогда
			СписокВыбора.Удалить(СписокВыбора.НайтиПоЗначению("НачалоФакт"));
		ИначеЕсли Параметры.ВариантРасположенияГраницыФактическихДанных = Перечисления.ВариантыРасположенияГраницыФактическиДанных.ВнутриПериодаБюджета Тогда
			СписокВыбора.Удалить(СписокВыбора.НайтиПоЗначению("ФактНачало"));
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаДеталиГраницДанных.Видимость = Ложь;
		Элементы.ГраницыДанных.Видимость = Ложь;
		Элементы.ПериодЗначения.Видимость = Ложь;
		
	КонецЕсли;
	
	УстановитьВариантыПериодов();
	УправлениеФормой();
	
	ВариантОкна = "БезГруппировки";
	Если Не Элементы.ГраницыДанных.Видимость Тогда
		ВариантОкна = "НефинансовыйПоказатель";
	ИначеЕсли Элементы.ПериодЗначения.Видимость Тогда
		ВариантОкна = "ГруппировкаПериод";
	КонецЕсли;
	
	ЭтаФорма.КлючСохраненияПоложенияОкна = "ВариантФормы_" + ВариантОкна;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Ошибки = Неопределено;
	
	НепроверяемыеРеквизиты = Новый Массив;
	ЕстьОшибкаВНачале = Ложь; ЕстьОшибкаВКонце = Ложь;
	
	Если Элементы.ГраницыДанных.Видимость Тогда
		УпорядоченныеПериодичности = Новый Массив;
		УпорядоченныеПериодичности.Добавить("СЕКУНДА");
		УпорядоченныеПериодичности.Добавить("МИНУТА");
		УпорядоченныеПериодичности.Добавить("ЧАС");
		Для Каждого ИмяЗапрещеннойПериодичности Из УпорядоченныеПериодичности Цикл
			Если Не ЕстьОшибкаВНачале И СтрНайти(ВРЕГ(НижняяГраницаДанных), ВРЕГ(ИмяЗапрещеннойПериодичности)) Тогда
				ТекстОшибки = НСтр("ru = 'Выражение границ начала периода не может содержать периодичность меньшую, чем день'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "НижняяГраницаДанных", ТекстОшибки, "");
				ЕстьОшибкаВНачале = Истина;
			КонецЕсли;
			Если Не ЕстьОшибкаВКонце И СтрНайти(ВРЕГ(ВерхняяГраницаДанных), ВРЕГ(ИмяЗапрещеннойПериодичности)) Тогда
				ТекстОшибки = НСтр("ru = 'Выражение границ конца периода не может содержать периодичность меньшую, чем день'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ВерхняяГраницаДанных", ТекстОшибки, "");
				ЕстьОшибкаВКонце = Истина;
			КонецЕсли;
			Если ЕстьОшибкаВНачале И ЕстьОшибкаВКонце Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НепроверяемыеРеквизиты.Добавить("НижняяГраницаДанных");
		НепроверяемыеРеквизиты.Добавить("ВерхняяГраницаДанных");
	КонецЕсли;
	
	ЕстьОшибкаВНачале = Ложь; ЕстьОшибкаВКонце = Ложь;
	
	Если ЗначениеЗаполнено(ПериодичностьГруппировки)
		И Элементы.ПериодЗначения.Видимость Тогда
		УпорядоченныеПериодичности = БюджетнаяОтчетностьКлиентСервер.УпорядоченныеПериодичности();
		УпорядоченныеПериодичности.Вставить(0, "СЕКУНДА");
		УпорядоченныеПериодичности.Вставить(0, "МИНУТА");
		УпорядоченныеПериодичности.Вставить(0, "ЧАС");
		Для Каждого Периодичность Из УпорядоченныеПериодичности Цикл
			Если Не ЗначениеЗаполнено(Периодичность) Тогда
				Продолжить;
			КонецЕсли;
			Если Периодичность = ПериодичностьГруппировки Тогда
				Прервать;
			КонецЕсли;
			Если ТипЗнч(Периодичность) = Тип("Строка") Тогда
				ИмяЗапрещеннойПериодичности = Периодичность;
			Иначе
				ИмяЗапрещеннойПериодичности = ФинансоваяОтчетностьКлиентСерверПовтИсп.ПериодичностьСтрокой(Периодичность);
			КонецЕсли;
			Если Не ЕстьОшибкаВНачале И СтрНайти(ВРЕГ(НачалоПериодаГруппировки), ВРЕГ(ИмяЗапрещеннойПериодичности)) Тогда
				ТекстОшибки = НСтр("ru = 'Выражение смещения начала периода группировки не может содержать периодичность меньшую, чем %1'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ПериодичностьГруппировки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "НачалоПериодаГруппировки", ТекстОшибки, "");
				ЕстьОшибкаВНачале = Истина;
			КонецЕсли;
			Если Не ЕстьОшибкаВКонце И СтрНайти(ВРЕГ(КонецПериодаГруппировки), ВРЕГ(ИмяЗапрещеннойПериодичности)) Тогда
				ТекстОшибки = НСтр("ru = 'Выражение смещения конца периода группировки не может содержать периодичность меньшую, чем %1'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ПериодичностьГруппировки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "КонецПериодаГруппировки", ТекстОшибки, "");
				ЕстьОшибкаВКонце = Истина;
			КонецЕсли;
			Если ЕстьОшибкаВНачале И ЕстьОшибкаВКонце Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не Элементы.ПериодЗначения.Видимость Тогда
		НепроверяемыеРеквизиты.Добавить("НачалоПериодаГруппировки");
		НепроверяемыеРеквизиты.Добавить("КонецПериодаГруппировки");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗначенияЗакрытия = БюджетнаяОтчетностьКлиентСервер.ПараметрыОткрытияФормыНастройкиПериода(ЭтаФорма, Ложь);
		Закрыть(ЗначенияЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГраницыДанныхПриИзменении(Элемент)
	
	ПеременныеПериодов = БюджетнаяОтчетностьКлиентСервер.ПеременныеПериодовБюджетирования();
	
	Если ГраницыДанных = "" Тогда
		
		НижняяГраницаДанных = ПеременныеПериодов.НачалоПериодаДанных.Имя;
		ВерхняяГраницаДанных = ПеременныеПериодов.КонецПериодаДанных.Имя;
		
	ИначеЕсли ГраницыДанных = "ФактНачало" Тогда
		
		НижняяГраницаДанных = ПеременныеПериодов.ГраницаФактДанных.Имя;
		ВерхняяГраницаДанных = "ДобавитьКДате(" + ПеременныеПериодов.НачалоПериодаДанных.Имя + ", ДЕНЬ, -1)";
		
	ИначеЕсли ГраницыДанных = "НачалоФакт" Тогда
		
		НижняяГраницаДанных = ПеременныеПериодов.НачалоПериодаДанных.Имя;
		ВерхняяГраницаДанных = ПеременныеПериодов.ГраницаФактДанных.Имя;
		
	ИначеЕсли ГраницыДанных = "ФактКонец" Тогда
		
		НижняяГраницаДанных = "ДобавитьКДате(" + ПеременныеПериодов.ГраницаФактДанных.Имя + ", ДЕНЬ, 1)";
		ВерхняяГраницаДанных = ПеременныеПериодов.КонецПериодаДанных.Имя;
		
	ИначеЕсли ГраницыДанных = "Произвольный" Тогда
		
		НижняяГраницаДанных = ПеременныеПериодов.НачалоПериодаДанных.Имя;
		ВерхняяГраницаДанных = ПеременныеПериодов.КонецПериодаДанных.Имя;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПериодаОтносительноГруппировкиПриИзменении(Элемент)
	
	ПеременныеПериодов = БюджетнаяОтчетностьКлиентСервер.ПеременныеПериодовБюджетирования();
	
	Если ВариантПериодаОтносительноГруппировки = "" Тогда
		
		НачалоПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя;
		КонецПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя;
		
	ИначеЕсли ВариантПериодаОтносительноГруппировки = "НарастающийИтог" Тогда
		
		НачалоПериодаГруппировки = ПеременныеПериодов.НачалоПериодаДанных.Имя;
		КонецПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя;
		
	ИначеЕсли ВариантПериодаОтносительноГруппировки = "ВесьПериод" Тогда
		
		НачалоПериодаГруппировки = ПеременныеПериодов.НачалоПериодаДанных.Имя;
		КонецПериодаГруппировки = ПеременныеПериодов.КонецПериодаДанных.Имя;
		
	ИначеЕсли ВариантПериодаОтносительноГруппировки = "Произвольный" Тогда
		
		НачалоПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя;
		КонецПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура НижняяГраницаПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФормулы", ЭтаФорма, "НижняяГраницаДанных");
	ОткрытьФорму("ОбщаяФорма.КонструкторФормул", 
		ПолучитьПараметрыФормыПериодаДанных(НижняяГраницаДанных),,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФормулы", ЭтаФорма, "ВерхняяГраницаДанных");
	ОткрытьФорму("ОбщаяФорма.КонструкторФормул", 
		ПолучитьПараметрыФормыПериодаДанных(ВерхняяГраницаДанных),,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстНачалаГруппировкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФормулы", ЭтаФорма, "НачалоПериодаГруппировки");
	ОткрытьФорму("ОбщаяФорма.КонструкторФормул", 
		ПолучитьПараметрыФормыПериодаГруппировки(НачалоПериодаГруппировки),,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОкончанияГруппировкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеФормулы", ЭтаФорма, "КонецПериодаГруппировки");
	ОткрытьФорму("ОбщаяФорма.КонструкторФормул", 
		ПолучитьПараметрыФормыПериодаГруппировки(КонецПериодаГруппировки),,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНастройкиГруппировки(Параметры)
	
	ЕстьПериод = Справочники.ЭлементыФинансовыхОтчетов.ЭлементРазвернутПоПериоду(Параметры, ПериодичностьГруппировки);
	Элементы.ПериодЗначения.Видимость = ЕстьПериод;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантыПериодов()
	
	ПеременныеПериодов = БюджетнаяОтчетностьКлиентСервер.ПеременныеПериодовБюджетирования();
	
	Если НижняяГраницаДанных = ПеременныеПериодов.НачалоПериодаДанных.Имя
		И ВерхняяГраницаДанных = ПеременныеПериодов.КонецПериодаДанных.Имя Тогда
		
		ГраницыДанных = "";
		
	ИначеЕсли НижняяГраницаДанных = ПеременныеПериодов.ГраницаФактДанных.Имя
		И ВерхняяГраницаДанных = "ДобавитьКДате(" + ПеременныеПериодов.НачалоПериодаДанных.Имя + ", ДЕНЬ, -1)" Тогда
		
		ГраницыДанных = "ФактНачало";
		
	ИначеЕсли НижняяГраницаДанных = ПеременныеПериодов.НачалоПериодаДанных.Имя
		И ВерхняяГраницаДанных = ПеременныеПериодов.ГраницаФактДанных.Имя Тогда
		
		ГраницыДанных = "НачалоФакт";
		
	ИначеЕсли НижняяГраницаДанных = "ДобавитьКДате(" + ПеременныеПериодов.ГраницаФактДанных.Имя + ", ДЕНЬ, 1)"
		И ВерхняяГраницаДанных = ПеременныеПериодов.КонецПериодаДанных.Имя Тогда
	
		ГраницыДанных = "ФактКонец";
		
	Иначе
		
		ГраницыДанных = "Произвольный";
		
	КонецЕсли;
	
	Если НачалоПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя 
		И КонецПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя Тогда
		
		ВариантПериодаОтносительноГруппировки = "";
		
	ИначеЕсли НачалоПериодаГруппировки = ПеременныеПериодов.НачалоПериодаДанных.Имя
		И КонецПериодаГруппировки = ПеременныеПериодов.ПериодГруппировки.Имя Тогда
		
		ВариантПериодаОтносительноГруппировки = "НарастающийИтог";
		
	ИначеЕсли НачалоПериодаГруппировки = ПеременныеПериодов.НачалоПериодаДанных.Имя
		И КонецПериодаГруппировки = ПеременныеПериодов.КонецПериодаДанных.Имя Тогда
		
		ВариантПериодаОтносительноГруппировки = "ВесьПериод";
		
	Иначе
		
		ВариантПериодаОтносительноГруппировки = "Произвольный";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ПроизвольныйПериодДанных = ГраницыДанных = "Произвольный";
	
	Элементы.НижняяГраницаДанных.Доступность = ПроизвольныйПериодДанных;
	Элементы.ВерхняяГраницаДанных.Доступность = ПроизвольныйПериодДанных;
	
	ПроизвольныйПериодГруппировки = ВариантПериодаОтносительноГруппировки = "Произвольный";
	
	Элементы.НачалоПериодаГруппировки.Доступность = ПроизвольныйПериодГруппировки;
	Элементы.КонецПериодаГруппировки.Доступность = ПроизвольныйПериодГруппировки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФормулы(Результат, ИмяПоля) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтаФорма[ИмяПоля] = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПостроитьДеревоОператоров()
	
	ДеревоОператоров = ФинансоваяОтчетностьВызовСервера.ПостроитьДеревоОператоров();
	ПредставлениеГруппыОператора = НСтр("ru = 'Функции'");
	СтрокаФункции = ДеревоОператоров.Строки.Найти(ПредставлениеГруппыОператора, "Представление");
	Если СтрокаФункции = Неопределено Тогда
		СтрокаФункции = ДеревоОператоров;
	КонецЕсли;
	
	Идентификатор = "ДобавитьКДате";
	КонструкцияДляВставки = "ДобавитьКДате( , МЕСЯЦ, 1)";
	Представление = НСтр("ru='Добавить месяц'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "ДобавитьКДате";
	КонструкцияДляВставки = "ДобавитьКДате( , ГОД, 1)";
	Представление = НСтр("ru='Добавить год'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "НачалоПериода";
	КонструкцияДляВставки = "НачалоПериода( , ГОД, 1)";
	Представление = НСтр("ru='Начало года'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "НачалоПериода";
	КонструкцияДляВставки = "НачалоПериода( , ПОЛУГОДИЕ)";
	Представление = НСтр("ru='Начало полугодия'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "НачалоПериода";
	КонструкцияДляВставки = "НачалоПериода( , КВАРТАЛ)";
	Представление = НСтр("ru='Начало квартала'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "НачалоПериода";
	КонструкцияДляВставки = "НачалоПериода( , МЕСЯЦ)";
	Представление = НСтр("ru='Начало месяца'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "НачалоПериода";
	КонструкцияДляВставки = "НачалоПериода( , НЕДЕЛЯ)";
	Представление = НСтр("ru='Начало недели'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "КонецПериода";
	КонструкцияДляВставки = "КонецПериода( , ГОД)";
	Представление = НСтр("ru='Конец года'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "КонецПериода";
	КонструкцияДляВставки = "КонецПериода( , ПОЛУГОДИЕ)";
	Представление = НСтр("ru='Конец полугодия'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "КонецПериода";
	КонструкцияДляВставки = "КонецПериода( , КВАРТАЛ)";
	Представление = НСтр("ru='Конец квартала'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "КонецПериода";
	КонструкцияДляВставки = "КонецПериода( , МЕСЯЦ)";
	Представление = НСтр("ru='Конец месяца'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Идентификатор = "КонецПериода";
	КонструкцияДляВставки = "КонецПериода( , НЕДЕЛЯ)";
	Представление = НСтр("ru='Конец недели'");
	РаботаСФормулами.ДобавитьОператор(СтрокаФункции,
	                                  Идентификатор,
	                                  КонструкцияДляВставки,
	                                  Представление);
	
	Возврат ПоместитьВоВременноеХранилище(ДеревоОператоров);
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыФормыПериодаДанных(Формула)
	
	ПеременныеПериодовБезСкобок = БюджетнаяОтчетностьКлиентСервер.ПеременныеПериодовБюджетирования(Истина);
	ОписаниеДаты = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	ДеревоОперандов = РаботаСФормулами.ПолучитьПустоеДеревоОперандов();
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.НачалоПериодаДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.НачалоПериодаДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.КонецПериодаДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.КонецПериодаДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.ГраницаФактДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.ГраницаФактДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	АдресДеревоОперандов = ПоместитьВоВременноеХранилище(ДеревоОперандов);
	
	ВозвращаемыеПараметры = Новый Структура;
	ВозвращаемыеПараметры.Вставить("Формула",                      Формула);
	ВозвращаемыеПараметры.Вставить("ДеревоОперандов",              АдресДеревоОперандов);
	ВозвращаемыеПараметры.Вставить("ОперандыЗаголовок",            НСтр("ru = 'Даты для расчета'"));
	ВозвращаемыеПараметры.Вставить("Операторы",                    ПостроитьДеревоОператоров());
	ВозвращаемыеПараметры.Вставить("ФормулаДляВычисленияВЗапросе", Истина);
	ВозвращаемыеПараметры.Вставить("ТипРезультата",                ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ВозвращаемыеПараметры.Вставить("НеИспользоватьПредставление",  Истина);
	
	Возврат ВозвращаемыеПараметры;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыФормыПериодаГруппировки(Формула)
	
	ПеременныеПериодовБезСкобок = БюджетнаяОтчетностьКлиентСервер.ПеременныеПериодовБюджетирования(Истина);
	ОписаниеДаты = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	ДеревоОперандов = РаботаСФормулами.ПолучитьПустоеДеревоОперандов();
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.НачалоПериодаДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.НачалоПериодаДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.КонецПериодаДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.КонецПериодаДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.ПериодГруппировки.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.ПериодГруппировки.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	НоваяСтрока = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	НоваяСтрока.Идентификатор = ПеременныеПериодовБезСкобок.ГраницаФактДанных.Имя;
	НоваяСтрока.Представление = ПеременныеПериодовБезСкобок.ГраницаФактДанных.Представление;
	НоваяСтрока.ТипЗначения = ОписаниеДаты;
	
	АдресДеревоОперандов = ПоместитьВоВременноеХранилище(ДеревоОперандов);
	
	ВозвращаемыеПараметры = Новый Структура;
	ВозвращаемыеПараметры.Вставить("Формула",                      Формула);
	ВозвращаемыеПараметры.Вставить("ДеревоОперандов",              АдресДеревоОперандов);
	ВозвращаемыеПараметры.Вставить("ОперандыЗаголовок",            НСтр("ru = 'Даты для расчета'"));
	ВозвращаемыеПараметры.Вставить("Операторы",                    ПостроитьДеревоОператоров());
	ВозвращаемыеПараметры.Вставить("ФормулаДляВычисленияВЗапросе", Истина);
	ВозвращаемыеПараметры.Вставить("ТипРезультата",                ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ВозвращаемыеПараметры.Вставить("НеИспользоватьПредставление",  Истина);
	
	Возврат ВозвращаемыеПараметры;
	
КонецФункции

#КонецОбласти
